app/views/inventories/show.html.erb

SELECT "inventory_foods".* FROM "inventory_foods" WHERE "inventory_foods"."inventory_id" = $1  [["inventory_id", 1]]
---
      <tbody class="">
        <% @inventory.inventory_foods.each do |item| %>