app/controllers/foods_controller.rb

    def index
      @foods = current_user.Foods.all
---
SELECT "foods".* FROM "foods" WHERE "foods"."user_id" = ?  [["user_id", 1]]

    def create
      @food = current_user.Foods.new(food_params)
      if @food.save
---
INSERT INTO "foods" ("user_id", "name", "measurement", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["name", "Rice"], ["measurement", "kg"], ["price", "200.0"], ["created_at", "2023-05-04 16:19:42.964363"], ["updated_at", "2023-05-04 16:19:42.964363"]]

    def destroy
      @food = current_user.Foods.find(params[:id])

      if @food.destroy
---
SELECT "foods".* FROM "foods" WHERE "foods"."user_id" = ? AND "foods"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
DELETE FROM "foods" WHERE "foods"."id" = ?  [["id", 1]]