app/controllers/inventories_controller.rb

INSERT INTO "inventories" ("user_id", "created_at", "updated_at", "name") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["created_at", "2023-05-04 18:26:29.825110"], ["updated_at", "2023-05-04 18:26:29.825110"], ["name", "hey yo"]]
---
  def create
    @inventory = Inventory.new(post_data)
    @inventory.user_id = current_user.id

    if @inventory.save

SELECT "inventories".* FROM "inventories" WHERE "inventories"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "inventories" WHERE "inventories"."id" = ?  [["id", 3]]
---
  def destroy
    @inventory = Inventory.find(params[:id])
    @inventory.destroy

SELECT "inventories".* FROM "inventories" WHERE "inventories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @inventory = Inventory.find_by(id: params[:id])

SELECT "inventories".* FROM "inventories" WHERE "inventories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_inventory
    @inventory = Inventory.find(params[:id])