app/controllers/inventory_foods_controller.rb

SELECT "inventories".* FROM "inventories" WHERE "inventories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def new
        @user = current_user
        @inventory = Inventory.find_by_id(params[:inventory_id])

SELECT "inventories".* FROM "inventories" WHERE "inventories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "inventory_foods" ("inventory_id", "food_id", "quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["inventory_id", 1], ["food_id", 3], ["quantity", 25], ["created_at", "2023-05-04 20:59:02.779389"], ["updated_at", "2023-05-04 20:59:02.779389"]]
---
      def create
        @inventory = Inventory.find_by_id(params[:inventory_id])
        @inventory_food = InventoryFood.new(inventory_food_params.merge(inventory_id: @inventory.id))
        if @inventory_food.valid?
          @inventory_food.save

SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
      def destroy
        @inventory_food = InventoryFood.find_by_id(params[:id])