app/controllers/public_recipes_controller.rb

    def index
        @recipes = Recipe.where(plublic: true).order(created_at: :desc)
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."plublic" = ? ORDER BY "recipes"."created_at" DESC  [["plublic", 1]]