app/controllers/recipe_foods_controller.rb

    def new
      @user = current_user
      @recipe = Recipe.find_by_id(params[:recipe_id])
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
      @recipe = Recipe.find_by_id(params[:recipe_id])
      @recipe_food = RecipeFood.new(recipe_food_params.merge(recipe_id: @recipe.id))
      if @recipe_food.valid?
        @recipe_food.save
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "recipe_foods" ("recipe_id", "food_id", "quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["recipe_id", 1], ["food_id", 3], ["quantity", 60], ["created_at", "2023-05-04 21:17:58.328670"], ["updated_at", "2023-05-04 21:17:58.328670"]]

    def destroy
      @recipe_food = RecipeFood.find_by_id(params[:id])
      if @recipe_food.destroy
---
SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "recipe_foods" WHERE "recipe_foods"."id" = $1  [["id", 5]]