app/controllers/recipes_controller.rb

  def show
    @recipe = Recipe.find_by_id(params[:id])
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @recipe = Recipe.new(recipe_params)
    @recipe.user_id = current_user.id

    if @recipe.save
---
INSERT INTO "recipes" ("user_id", "name", "description", "public", "created_at", "updated_at", "cooking_time", "preparation_time") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"