app/controllers/shopping_list_controller.rb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 6]]
SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def fetch_recipe
    recipe = Recipe.find_by_id(params[:recipe_id])
    recipe_ingredients = []
    recipe&.recipe_foods&.each do |food|
      food_data = Food.find_by_id(food.food_id)

SELECT "inventories".* FROM "inventories" WHERE "inventories"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "inventory_foods".* FROM "inventory_foods" WHERE "inventory_foods"."inventory_id" = $1  [["inventory_id", 2]]
---
  def fetch_inventory
    inventory = Inventory.find_by_id(params[:inventory_id])
    inventory_quantities = []
    inventory&.inventory_foods&.each do |food|